readme.org
* TODO Mode d'emploi
** Installation

#+BEGIN_SRC bash
 pip install fast-eval
#+END_SRC

** Fichier de configuration
Champs à adapter :

- required_files :: Fichiers à chercher dans le rendu des étudiants.

- reference_folder :: Dossier dont le contenu est à copier dans le
  dossier d'évaluation de chaque rendu. Cela peut être des /headers/
  nécessaires à la compilation, des programmes de tests etc... Chaîne
  vide si pas besoin de dossier de référence.

- comp_commands :: Liste de commandes à effectuer lors de l'étape de
  compilation. Liste vide si rien à faire.

- execution_commands :: Liste de commandes à effectuer lors de l'étape
  d'exécution/évaluation. Liste vide si rien à faire.
#+BEGIN_SRC json :tangle example/config.json
  {
    "required_files": [
      "exo1.c"
    ],
    "reference_folder": "~/coucou_ref",
    "compilation_commands": [
      "gcc exo1.c -o exo1 -Wall"
    ],
    "execution_commands": [
      "./exo1"
    ]
  }
#+END_SRC

** Usage

#+BEGIN_SRC bash :results output :exports both
  fast-eval -h
#+END_SRC

#+RESULTS:
: usage: fast-eval [-h] [--ws WS] config archive_path
:
: positional arguments:
:   config        path of json config file
:   archive_path  path of archive from arche
:
: optional arguments:
:   -h, --help    show this help message and exit
:   --ws WS       where to build workspace

* Concept

** Pourquoi ?
L'objectif de ce projet est de faciliter l'évaluation de TPs d'info.
Généralement la procédure d'évaluation est la même :

- Récupération :: Je récupère tous les travaux soumis dans une unique
  archive fournie par Arche. (manuellement pour l'instant, il ne
  semble pas qu'il y ait d'API arche accessible).

- Préparation :: Chaque travail est généralement soumis sous la forme
  d'une archive, dont l'organisation varie souvent énormément d'un
  étudiant à l'autre. Cette partie est donc fastidieuse : il faut
  extraire un à un chaque archive, puis chercher les fichiers
  réellement utiles (en général un ou plusieurs fichiers source).

- Compilation :: Selon le projet et le langage, exécution de make,
  gcc etc... Idem, c'est fastidieux, et facilement scriptable.

- Exécution et évaluation :: Faire tourner le programme et voir ce que
  cela donne. Une partie plus ou moins couvrante peut être déléguée à
  des logiciels de tests, permettant d'avoir rapidement une idée de la
  pertinence de la solution soumise.

** Comment ?

Automatisation de la préparation, compilation et pourquoi pas d'une
partie de l'évaluation.

Cette automatisation ce concrétise par un programme python permettant
de faire une grosse partie du travail fastidieux et répétitif
nécessaire lors de l'évaluation de TPs/projets.

* Implémentation

** Package declaration
*** Fichier de setup
#+begin_src python :tangle setup.py
# -*- coding: utf-
from setuptools import setup, find_packages

setup(
    name='fast-eval',
    packages=find_packages(exclude=["examples/*"]),
    version='0.2.3',
    description='Simple tool to provide automation to assessment processes.',
    author=u'Virgile Daugé',
    author_email='virgile.dauge@pm.me',
    url='https://github.com/Virgile-Dauge/fast-eval',
    # download_url='',
    keywords=['assessment', 'evaluation'],
    install_requires=['colored'],
    classifiers=[
        'Development Status :: 4 - Beta',
        'Environment :: Console',
        'Intended Audience :: Developers',
        'License :: OSI Approved :: GNU General Public License v3 (GPLv3)',
        'Operating System :: POSIX',
        'Programming Language :: Python :: 3.6',
        ],
    entry_points={
        'console_scripts': [
            'fast-eval=fast_eval.__main__:main',
        ],
    },
    python_requires='>=3.6',
)
#+end_src

#+BEGIN_SRC bash :results output :cache yes
mkdir fast_eval
tree .
#+END_SRC

#+RESULTS[5c942e2388023d571e100ded4100f76a38d146f2]:
: .
: ├── fast_eval
: │   ├── fast_eval.py
: │   └── __main__.py
: ├── LICENSE
: ├── readme.org
: └── setup.py
:
: 1 directory, 5 files

#+begin_src python :tangle fast_eval/__init__.py
#+end_src
** Cli

#+begin_src python :tangle fast_eval/__main__.py
  #!/usr/bin/env python3
  import argparse
  from fast_eval.util import FastEval
  def main():
      parser = argparse.ArgumentParser()
      parser.add_argument("config",
                          help="path of json config file")
      parser.add_argument("archive_path",
                          help="path of archive from arche")
      parser.add_argument("--ws",
                          help="where to build workspace")
      parser.add_argument("-v", "--verbose", help="increase output verbosity",
                          action="store_true")
      fe = FastEval(parser.parse_args())
#+end_src

#+RESULTS:

** Dépendances

#+begin_src python :tangle fast_eval/util.py :noweb yes
  # Pour lecture de dossiers/fichiers
  import os
  import sys
  import csv
  import json
  # Pour affichage de dict
  import pprint
  # Pour décomprésser
  import shutil
  # Pour Exécution de programmes
  import subprocess

  from colored import fg, bg, attr
  # Helpers
  <<list_files>>
  <<search_files>>
  <<choice_str>>
#+end_src

** TODO Class
