readme.md
- [Mode d'emploi](#orgb08e66b)
  - [Installation](#org2023432)
  - [Fichier de configuration](#org02e975c)
  - [Usage](#org5eb83e5)
- [Concept](#orgc11a466)
  - [Pourquoi ?](#org3ddfdcb)
  - [Comment ?](#orga5fb0b5)
- [Implémentation](#orga7e0d29)
  - [Package declaration](#orgf7ed530)
    - [Fichier de setup](#org666e359)
  - [Cli](#org0154e9e)
  - [Dépendances](#orgbca24e7)
  - [Class](#orge3cf804)
    - [Init](#orge899956)
    - [Print Helpers](#orgeb8bc59)
    - [Json data files](#orgd2c47c3)
    - [Préparation](#orgf9dbbb0)
    - [Compilation](#orgf057a59)
- [Déploiement vers Pypi](#org8fa2f4d)
- [Github Pages](#orga431284)


<a id="orgb08e66b"></a>

# TODO Mode d'emploi


<a id="org2023432"></a>

## Installation

```bash
pip install fast-eval
```


<a id="org02e975c"></a>

## Fichier de configuration

Champs à adapter :

-   **required<sub>files</sub>:** Fichiers à chercher dans le rendu des étudiants.

-   **reference<sub>folder</sub>:** Dossier dont le contenu est à copier dans le dossier d'évaluation de chaque rendu. Cela peut être des *headers* nécessaires à la compilation, des programmes de tests etc&#x2026; Chaîne vide si pas besoin de dossier de référence.

-   **comp<sub>commands</sub>:** Liste de commandes à effectuer lors de l'étape de compilation. Liste vide si rien à faire.

```json
{
  "required_files": [
    "exo1.c"
  ],
  "reference_folder": "~/coucou_ref",
  "compilation_commands": [
    "gcc exo1.c -o exo1 -Wall"
  ],
  "execution_commands": [
    "./exo1"
  ]
}
```


<a id="org5eb83e5"></a>

## Usage

```bash
fast-eval -h
```

    usage: fast-eval [-h] [--ws WS] config archive_path

    positional arguments:
      config        path of json config file
      archive_path  path of archive from arche

    optional arguments:
      -h, --help    show this help message and exit
      --ws WS       where to build workspace


<a id="orgc11a466"></a>

# Concept


<a id="org3ddfdcb"></a>

## Pourquoi ?

L'objectif de ce projet est de faciliter l'évaluation de TPs d'info. Généralement la procédure d'évaluation est la même :

-   **Récupération:** Je récupère tous les travaux soumis dans une unique archive fournie par Arche. (manuellement pour l'instant, il ne semble pas qu'il y ait d'API arche accessible).

-   **Préparation:** Chaque travail est généralement soumis sous la forme d'une archive, dont l'organisation varie souvent énormément d'un étudiant à l'autre. Cette partie est donc fastidieuse : il faut extraire un à un chaque archive, puis chercher les fichiers réellement utiles (en général un ou plusieurs fichiers source).

-   **Compilation:** Selon le projet et le langage, exécution de make, gcc etc&#x2026; Idem, c'est fastidieux, et facilement scriptable.

-   **Exécution et évaluation:** Faire tourner le programme et voir ce que cela donne. Une partie plus ou moins couvrante peut être déléguée à des logiciels de tests, permettant d'avoir rapidement une idée de la pertinence de la solution soumise.


<a id="orga5fb0b5"></a>

## Comment ?

Automatisation de la préparation, compilation et pourquoi pas d'une partie de l'évaluation.

Cette automatisation ce concrétise par un programme python permettant de faire une grosse partie du travail fastidieux et répétitif nécessaire lors de l'évaluation de TPs/projets.


<a id="orga7e0d29"></a>

# Implémentation


<a id="orgf7ed530"></a>

## Package declaration


<a id="org666e359"></a>

### Fichier de setup

```python
# -*- coding: utf-
from setuptools import setup, find_packages

setup(
    name='fast-eval',
    packages=find_packages(exclude=["examples/*"]),
    version='0.2.0',
    description='Simple tool to provide automation to assessment processes.',
    author=u'Virgile Daugé',
    author_email='virgile.dauge@pm.me',
    url='https://github.com/Virgile-Dauge/fast-eval',
    # download_url='',
    keywords=['assessment', 'evaluation'],
    install_requires=['colored'],
    classifiers=[
        'Development Status :: 4 - Beta',
        'Environment :: Console',
        'Intended Audience :: Developers',
        'License :: OSI Approved :: GNU General Public License v3 (GPLv3)',
        'Operating System :: POSIX',
        'Programming Language :: Python :: 3.6',
        ],
    entry_points={
        'console_scripts': [
            'fast-eval=fast_eval.__main__:main',
        ],
    },
    python_requires='>=3.6',
)
```

```bash
mkdir fast_eval
tree .
```

```python

```


<a id="org0154e9e"></a>

## Cli

```python
#!/usr/bin/env python3
import argparse
from fast_eval.util import FastEval
def main():
    parser = argparse.ArgumentParser()
    parser.add_argument("config",
                        help="path of json config file")
    parser.add_argument("archive_path",
                        help="path of archive from arche")
    parser.add_argument("--ws",
                        help="where to build workspace")
    fe = FastEval(parser.parse_args())

```


<a id="orgbca24e7"></a>

## Dépendances

```python
# Pour lecture de dossiers/fichiers
import os
import sys
import csv
import json
# Pour affichage de dict
import pprint
# Pour décomprésser
import shutil
# Pour Exécution de programmes
import subprocess

from colored import fg, bg, attr
