readme.org
*** Compilation

#+name: next_step
#+begin_src python
  def next_step(self, step):
      if step == '0_prep':
          return '1_comp'
      elif step == '1_comp':
          return '2_exec'
      elif step == '2_exec':
          return '3_eval'
      else:
          return 'done'
#+end_src

#+name: exte_step
#+begin_src python
  def exte_step(self, cmd, step='1_comp', label='Compiling'):
      to_exec = [sub for sub in self.submissions if self.submissions[sub]['step'] == step]
      print('{}  {} projects...'.format(label, len(to_exec)))
      root_dir = os.getcwd()
      for sub in to_exec:
          os.chdir(os.path.join(self.submissions[sub]['path'], 'eval'))
          comp_ok = True
          for c in cmd:
              completed_process = subprocess.run([c], capture_output=True, text=True, shell=True)
              if completed_process.returncode == 1:
                  comp_ok=False
              cond = [len(completed_process.stderr) > 0, len(completed_process.stdout) > 0]
              if any(cond) and c not in self.submissions[sub]['steps'][step]:
                  self.submissions[sub]['steps'][step][c] = {}
              if cond[0]:
                  self.submissions[sub]['steps'][step][c]['stderr'] = completed_process.stderr.split('\n')
              if cond[1]:
                  self.submissions[sub]['steps'][step][c]['stdout'] = completed_process.stdout.split('\n')
          if comp_ok:
              self.submissions[sub]['step'] = self.next_step(step)
      os.chdir(root_dir)
      to_exec = [sub for sub in self.submissions if self.submissions[sub]['step'] == step]
      print('           ' + self.erro_str('{} fails.'.format(len(to_exec))) + '\n')

#+end_src

* Déploiement vers Pypi

#+BEGIN_SRC bash :results output
rm -rf dist/
python setup.py sdist
#+END_SRC

#+RESULTS[8b5455aa48284574821df6568e30b543c07617d9]:
#+begin_example
running sdist
running egg_info
writing fast_eval.egg-info/PKG-INFO
writing dependency_links to fast_eval.egg-info/dependency_links.txt
writing entry points to fast_eval.egg-info/entry_points.txt
writing requirements to fast_eval.egg-info/requires.txt
writing top-level names to fast_eval.egg-info/top_level.txt
reading manifest file 'fast_eval.egg-info/SOURCES.txt'
writing manifest file 'fast_eval.egg-info/SOURCES.txt'
running check
creating fast-eval-0.2.3
creating fast-eval-0.2.3/fast_eval
creating fast-eval-0.2.3/fast_eval.egg-info
copying files to fast-eval-0.2.3...
copying setup.py -> fast-eval-0.2.3
copying fast_eval/__init__.py -> fast-eval-0.2.3/fast_eval
copying fast_eval/__main__.py -> fast-eval-0.2.3/fast_eval
copying fast_eval/util.py -> fast-eval-0.2.3/fast_eval
copying fast_eval.egg-info/PKG-INFO -> fast-eval-0.2.3/fast_eval.egg-info
copying fast_eval.egg-info/SOURCES.txt -> fast-eval-0.2.3/fast_eval.egg-info
copying fast_eval.egg-info/dependency_links.txt -> fast-eval-0.2.3/fast_eval.egg-info
copying fast_eval.egg-info/entry_points.txt -> fast-eval-0.2.3/fast_eval.egg-info
copying fast_eval.egg-info/requires.txt -> fast-eval-0.2.3/fast_eval.egg-info
copying fast_eval.egg-info/top_level.txt -> fast-eval-0.2.3/fast_eval.egg-info
Writing fast-eval-0.2.3/setup.cfg
creating dist
Creating tar archive
removing 'fast-eval-0.2.3' (and everything under it)
#+end_example

#+BEGIN_SRC bash
  twine upload dist/*
#+END_SRC

#+RESULTS:
* Github Pages

#+BEGIN_SRC bash
mkdir docs
#+END_SRC

#+BEGIN_SRC yaml :tangle docs/_config.yml
theme: jekyll-theme-architect
#+END_SRC

#+BEGIN_SRC bash
cp readme.md docs/index.md
#+END_SRC

#+RESULTS:
